app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "tags".* FROM "tags"
---
def index

	@articles = Article.all
  @tag = Tag.all

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "hamburger"], ["created_at", "2014-07-23 17:51:48.803778"], ["title", "hamburger"], ["updated_at", "2014-07-23 17:51:48.803778"]]
---
   def create
        @article = Article.new(article_params)

        @article.save