app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors"  WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @author = Author.new
    @authors =Author.find(:all, :order => 'name')

INSERT INTO "authors" ("created_at", "email", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-27 21:28:33.347028"], ["email", ""], ["updated_at", "2014-07-27 21:28:33.347028"], ["username", ""]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save