app/controllers/comments_controller.rb

	def create
      @comment = Comment.new(comment_params)
      @comment.article_id = params[:article_id]

      @comment.save
---
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 5], ["author_name", "Mike"], ["body", "Nice!"], ["created_at", "2014-07-24 16:48:27.709815"], ["updated_at", "2014-07-24 16:48:27.709815"]]